{"id": "http://arxiv.org/abs/2512.24925v1", "title": "Towards Provably Secure Generative AI: Reliable Consensus Sampling", "summary": "Existing research on generative AI security is primarily driven by mutually reinforcing attack and defense methodologies grounded in empirical experience. This dynamic frequently gives rise to previously unknown attacks that can circumvent current detection and prevention. This necessitates the continual updating of security mechanisms. Constructing generative AI with provable security and theoretically controllable risk is therefore necessary. Consensus Sampling (CS) is a promising algorithm toward provably secure AI. It controls risk by leveraging overlap in model output probabilities. However, we find that CS relies on frequent abstention to avoid unsafe outputs, which reduces utility. Moreover, CS becomes highly vulnerable when unsafe models are maliciously manipulated. To address these issues, we propose a new primitive called Reliable Consensus Sampling (RCS), that traces acceptance probability to tolerate extreme adversarial behaviors, improving robustness. RCS also eliminates the need for abstention entirely. We further develop a feedback algorithm to continuously and dynamically enhance the safety of RCS. We provide theoretical guarantees that RCS maintains a controllable risk threshold. Extensive experiments show that RCS significantly improves robustness and utility while maintaining latency comparable to CS. We hope this work contributes to the development of provably secure generative AI.", "published": "2025-12-31T15:33:57Z", "updated": "2025-12-31T15:33:57Z", "authors": ["Yu Cui", "Hang Fu", "Sicheng Pan", "Zhuoyu Sun", "Yifei Liu", "Yuhong Nie", "Bo Ran", "Baohan Huang", "Xufeng Zhang", "Haibin Zhang", "Cong Zuo", "Licheng Wang"], "pdf_url": "https://arxiv.org/pdf/2512.24925v1"}
{"id": "http://arxiv.org/abs/2512.24899v1", "title": "MTSP-LDP: A Framework for Multi-Task Streaming Data Publication under Local Differential Privacy", "summary": "The proliferation of streaming data analytics in data-driven applications raises critical privacy concerns, as directly collecting user data may compromise personal privacy. Although existing $w$-event local differential privacy (LDP) mechanisms provide formal guarantees without relying on trusted third parties, their practical deployment is hindered by two key limitations. First, these methods are designed primarily for publishing simple statistics at each timestamp, making them inherently unsuitable for complex queries. Second, they handle data at each timestamp independently, failing to capture temporal correlations and consequently degrading the overall utility. To address these issues, we propose MTSP-LDP, a novel framework for \\textbf{M}ulti-\\textbf{T}ask \\textbf{S}treaming data \\textbf{P}ublication under $w$-event LDP. MTSP-LDP adopts an \\emph{Optimal Privacy Budget Allocation} algorithm to dynamically allocate privacy budgets by analyzing temporal correlations within each window. It then constructs a \\emph{data-adaptive private binary tree structure} to support complex queries, which is further refined by cross-timestamp grouping and smoothing operations to enhance estimation accuracy. Furthermore, a unified \\emph{Budget-Free Multi-Task Processing} mechanism is introduced to support a variety of streaming queries without consuming additional privacy budget. Extensive experiments on real-world datasets demonstrate that MTSP-LDP consistently achieves high utility across various streaming tasks, significantly outperforming existing methods.", "published": "2025-12-31T14:52:29Z", "updated": "2025-12-31T14:52:29Z", "authors": ["Chang Liu", "Junzhou Zhao"], "pdf_url": "https://arxiv.org/pdf/2512.24899v1"}
{"id": "http://arxiv.org/abs/2512.24888v1", "title": "SoK: Web3 RegTech for Cryptocurrency VASP AML/CFT Compliance", "summary": "The decentralized architecture of Web3 technologies creates fundamental challenges for Anti-Money Laundering and Counter-Financing of Terrorism compliance. Traditional regulatory technology solutions designed for centralized financial systems prove inadequate for blockchain's transparent yet pseudonymous networks. This systematization examines how blockchain-native RegTech solutions leverage distributed ledger properties to enable novel compliance capabilities.\n  We develop three taxonomies organizing the Web3 RegTech domain: a regulatory paradigm evolution framework across ten dimensions, a compliance protocol taxonomy encompassing five verification layers, and a RegTech lifecycle framework spanning preventive, real-time, and investigative phases. Through analysis of 41 operational commercial platforms and 28 academic prototypes selected from systematic literature review (2015-2025), we demonstrate that Web3 RegTech enables transaction graph analysis, real-time risk assessment, cross-chain analytics, and privacy-preserving verification approaches that are difficult to achieve or less commonly deployed in traditional centralized systems.\n  Our analysis reveals critical gaps between academic innovation and industry deployment, alongside persistent challenges in cross-chain tracking, DeFi interaction analysis, privacy protocol monitoring, and scalability. We synthesize architectural best practices and identify research directions addressing these gaps while respecting Web3's core principles of decentralization, transparency, and user sovereignty.", "published": "2025-12-31T14:31:29Z", "updated": "2025-12-31T14:31:29Z", "authors": ["Qian'ang Mao", "Jiaxin Wang", "Ya Liu", "Li Zhu", "Jiaman Chen", "Jiaqi Yan"], "pdf_url": "https://arxiv.org/pdf/2512.24888v1"}
{"id": "http://arxiv.org/abs/2509.22256v3", "title": "Secure and Efficient Access Control for Computer-Use Agents via Context Space", "summary": "Large language model (LLM)-based computer-use agents represent a convergence of AI and OS capabilities, enabling natural language to control system- and application-level functions. However, due to LLMs' inherent uncertainty issues, granting agents control over computers poses significant security risks. When agent actions deviate from user intentions, they can cause irreversible consequences. Existing mitigation approaches, such as user confirmation and LLM-based dynamic action validation, still suffer from limitations in usability, security, and performance. To address these challenges, we propose CSAgent, a system-level, static policy-based access control framework for computer-use agents. To bridge the gap between static policy and dynamic context and user intent, CSAgent introduces intent- and context-aware policies, and provides an automated toolchain to assist developers in constructing and refining them. CSAgent enforces these policies through an optimized OS service, ensuring that agent actions can only be executed under specific user intents and contexts. CSAgent supports protecting agents that control computers through diverse interfaces, including API, CLI, and GUI. We implement and evaluate CSAgent, which successfully defends against more than 99.56% of attacks while introducing only 1.99% performance overhead.", "published": "2025-09-26T12:19:27Z", "updated": "2025-12-31T07:56:16Z", "authors": ["Haochen Gong", "Chenxiao Li", "Rui Chang", "Wenbo Shen"], "pdf_url": "https://arxiv.org/pdf/2509.22256v3"}
{"id": "http://arxiv.org/abs/2512.24682v1", "title": "CellSecInspector: Safeguarding Cellular Networks via Automated Security Analysis on Specifications", "summary": "The complexity, interdependence, and rapid evolution of 3GPP specifications present fundamental challenges for ensuring the security of modern cellular networks. Manual reviews and existing automated approaches, which often depend on rule-based parsing or small sets of manually crafted security requirements, fail to capture deep semantic dependencies, cross-sentence/clause relationships, and evolving specification behaviors. In this work, we present CellSecInspector, an automated framework for security analysis of 3GPP specifications. CellSecInspector extracts structured state-condition-action (SCA) representations, models mobile network procedures with comprehensive function chains, systematically validates them against 9 foundational security properties under 4 adversarial scenarios, and automatically generates test cases. This end-to-end pipeline enables the automated discovery of vulnerabilities without relying on manually predefined security requirements or rules. Applying CellSecInspector to the well-studied 5G and 4G NAS and RRC specifications, it discovers 43 vulnerabilities, 8 of which are previously unreported. Our findings show that CellSecInspector is a scalable, adaptive, and effective solution to assess 3GPP specifications for safeguarding operational and next-generation cellular networks.", "published": "2025-12-31T07:22:28Z", "updated": "2025-12-31T07:22:28Z", "authors": ["Ke Xie", "Xingyi Zhao", "Yiwen Hu", "Munshi Saifuzzaman", "Wen Li", "Shuhan Yuan", "Tian Xie", "Guan-Hua Tu"], "pdf_url": "https://arxiv.org/pdf/2512.24682v1"}
{"id": "http://arxiv.org/abs/2510.17884v3", "title": "When Intelligence Fails: An Empirical Study on Why LLMs Struggle with Password Cracking", "summary": "The remarkable capabilities of Large Language Models (LLMs) in natural language understanding and generation have sparked interest in their potential for cybersecurity applications, including password guessing. In this study, we conduct an empirical investigation into the efficacy of pre-trained LLMs for password cracking using synthetic user profiles. Specifically, we evaluate the performance of state-of-the-art open-source LLMs such as TinyLLaMA, Falcon-RW-1B, and Flan-T5 by prompting them to generate plausible passwords based on structured user attributes (e.g., name, birthdate, hobbies). Our results, measured using Hit@1, Hit@5, and Hit@10 metrics under both plaintext and SHA-256 hash comparisons, reveal consistently poor performance, with all models achieving less than 1.5% accuracy at Hit@10. In contrast, traditional rule-based and combinator-based cracking methods demonstrate significantly higher success rates. Through detailed analysis and visualization, we identify key limitations in the generative reasoning of LLMs when applied to the domain-specific task of password guessing. Our findings suggest that, despite their linguistic prowess, current LLMs lack the domain adaptation and memorization capabilities required for effective password inference, especially in the absence of supervised fine-tuning on leaked password datasets. This study provides critical insights into the limitations of LLMs in adversarial contexts and lays the groundwork for future efforts in secure, privacy-preserving, and robust password modeling.", "published": "2025-10-18T02:15:28Z", "updated": "2025-12-31T06:54:39Z", "authors": ["Mohammad Abdul Rehman", "Syed Imad Ali Shah", "Abbas Anwar", "Noor Islam", "Hamid Khan"], "pdf_url": "https://arxiv.org/pdf/2510.17884v3"}
{"id": "http://arxiv.org/abs/2501.07033v3", "title": "Detection of AI Deepfake and Fraud in Online Payments Using GAN-Based Models", "summary": "This study explores the use of Generative Adversarial Networks (GANs) to detect AI deepfakes and fraudulent activities in online payment systems. With the growing prevalence of deepfake technology, which can manipulate facial features in images and videos, the potential for fraud in online transactions has escalated. Traditional security systems struggle to identify these sophisticated forms of fraud. This research proposes a novel GAN-based model that enhances online payment security by identifying subtle manipulations in payment images. The model is trained on a dataset consisting of real-world online payment images and deepfake images generated using advanced GAN architectures, such as StyleGAN and DeepFake. The results demonstrate that the proposed model can accurately distinguish between legitimate transactions and deepfakes, achieving a high detection rate above 95%. This approach significantly improves the robustness of payment systems against AI-driven fraud. The paper contributes to the growing field of digital security, offering insights into the application of GANs for fraud detection in financial services. Keywords- Payment Security, Image Recognition, Generative Adversarial Networks, AI Deepfake, Fraudulent Activities", "published": "2025-01-13T03:10:54Z", "updated": "2025-12-31T06:07:44Z", "authors": ["Zong Ke", "Shicheng Zhou", "Yining Zhou", "Chia Hong Chang", "Rong Zhang"], "pdf_url": "https://arxiv.org/pdf/2501.07033v3"}
{"id": "http://arxiv.org/abs/2512.24652v1", "title": "Practical Traceable Over-Threshold Multi-Party Private Set Intersection", "summary": "Multi-Party Private Set Intersection (MP-PSI) with threshold enhances the flexibility of MP-PSI by disclosing elements present in at least $t$ participants' sets, rather than requiring elements to appear in all $n$ sets. In scenarios where each participant is responsible for its dataset, e.g., digital forensics, MP-PSI with threshold should disclose both intersection elements and corresponding holders such that elements are traceable and the reliability of intersection is guaranteed. We refer to MP-PSI with threshold supporting traceability as Traceable Over-Threshold MP-PSI (T-OT-MP-PSI). However, research on such protocols remains limited, and existing work tolerates at most $t-2$ semi-honest participants at considerable computational cost. We propose two novel Traceable OT-MP-PSI protocols. The first, Efficient Traceable OT-MP-PSI (ET-OT-MP-PSI), combines Shamir's secret sharing with an oblivious programmable pseudorandom function, achieving significantly improved efficiency with resistance to at most $t-2$ semi-honest participants. The second, Security-enhanced Traceable OT-MP-PSI (ST-OT-MP-PSI), achieves security against up to $n-1$ semi-honest participants by further leveraging the oblivious linear evaluation protocol. Compared to Mahdavi et al.'s protocol, ours eliminate the assumption that certain special parties do not collude. Experimental results demonstrate significant improvements: for $n=5$, $t=3$, and sets of size $2^{14}$, ET-OT-MP-PSI achieves $15056\\times$ speedup and ST-OT-MP-PSI achieves $505\\times$ speedup over Mahdavi et al.'s protocol.", "published": "2025-12-31T05:59:14Z", "updated": "2025-12-31T05:59:14Z", "authors": ["Le Yang", "Weijing You", "Huiyang He", "Kailiang Ji", "Jingqiang Lin"], "pdf_url": "https://arxiv.org/pdf/2512.24652v1"}
{"id": "http://arxiv.org/abs/2512.24602v1", "title": "Secure Digital Semantic Communications: Fundamentals, Challenges, and Opportunities", "summary": "Semantic communication (SemCom) has emerged as a promising paradigm for future wireless networks by prioritizing task-relevant meaning over raw data delivery, thereby reducing communication overhead and improving efficiency. However, shifting from bit-accurate transmission to task-oriented delivery introduces new security and privacy risks. These include semantic leakage, semantic manipulation, knowledge base vulnerabilities, model-related attacks, and threats to authenticity and availability. Most existing secure SemCom studies focus on analog SemCom, where semantic features are mapped to continuous channel inputs. In contrast, digital SemCom transmits semantic information through discrete bits or symbols within practical transceiver pipelines, offering stronger compatibility with realworld systems while exposing a distinct and underexplored attack surface. In particular, digital SemCom typically represents semantic information over a finite alphabet through explicit digital modulation, following two main routes: probabilistic modulation and deterministic modulation. These discrete mechanisms and practical transmission procedures introduce additional vulnerabilities affecting bit- or symbol-level semantic information, the modulation stage, and packet-based delivery and protocol operations. Motivated by these challenges and the lack of a systematic analysis of secure digital SemCom, this paper reviews SemCom fundamentals, clarifies the architectural differences between analog and digital SemCom and their security implications, organizes the threat landscape for digital SemCom, and discusses potential defenses. Finally, we outline open research directions toward secure and deployable digital SemCom systems.", "published": "2025-12-31T03:44:37Z", "updated": "2025-12-31T03:44:37Z", "authors": ["Weixuan Chen", "Qianqian Yang", "Yuanyuan Jia", "Junyu Pan", "Shuo Shao", "Jincheng Dai", "Meixia Tao", "Ping Zhang"], "pdf_url": "https://arxiv.org/pdf/2512.24602v1"}
{"id": "http://arxiv.org/abs/2512.24571v1", "title": "SynRAG: A Large Language Model Framework for Executable Query Generation in Heterogeneous SIEM System", "summary": "Security Information and Event Management (SIEM) systems are essential for large enterprises to monitor their IT infrastructure by ingesting and analyzing millions of logs and events daily. Security Operations Center (SOC) analysts are tasked with monitoring and analyzing this vast data to identify potential threats and take preventive actions to protect enterprise assets. However, the diversity among SIEM platforms, such as Palo Alto Networks Qradar, Google SecOps, Splunk, Microsoft Sentinel and the Elastic Stack, poses significant challenges. As these systems differ in attributes, architecture, and query languages, making it difficult for analysts to effectively monitor multiple platforms without undergoing extensive training or forcing enterprises to expand their workforce. To address this issue, we introduce SynRAG, a unified framework that automatically generates threat detection or incident investigation queries for multiple SIEM platforms from a platform-agnostic specification. SynRAG can generate platformspecific queries from a single high-level specification written by analysts. Without SynRAG, analysts would need to manually write separate queries for each SIEM platform, since query languages vary significantly across systems. This framework enables seamless threat detection and incident investigation across heterogeneous SIEM environments, reducing the need for specialized training and manual query translation. We evaluate SynRAG against state-of-the-art language models, including GPT, Llama, DeepSeek, Gemma, and Claude, using Qradar and SecOps as representative SIEM systems. Our results demonstrate that SynRAG generates significantly better queries for crossSIEM threat detection and incident investigation compared to the state-of-the-art base models.", "published": "2025-12-31T02:35:51Z", "updated": "2025-12-31T02:35:51Z", "authors": ["Md Hasan Saju", "Austin Page", "Akramul Azim", "Jeff Gardiner", "Farzaneh Abazari", "Frank Eargle"], "pdf_url": "https://arxiv.org/pdf/2512.24571v1"}
{"id": "http://arxiv.org/abs/2511.20290v2", "title": "APT-CGLP: Advanced Persistent Threat Hunting via Contrastive Graph-Language Pre-Training", "summary": "Provenance-based threat hunting identifies Advanced Persistent Threats (APTs) on endpoints by correlating attack patterns described in Cyber Threat Intelligence (CTI) with provenance graphs derived from system audit logs. A fundamental challenge in this paradigm lies in the modality gap -- the structural and semantic disconnect between provenance graphs and CTI reports. Prior work addresses this by framing threat hunting as a graph matching task: 1) extracting attack graphs from CTI reports, and 2) aligning them with provenance graphs. However, this pipeline incurs severe \\textit{information loss} during graph extraction and demands intensive manual curation, undermining scalability and effectiveness.\n  In this paper, we present APT-CGLP, a novel cross-modal APT hunting system via Contrastive Graph-Language Pre-training, facilitating end-to-end semantic matching between provenance graphs and CTI reports without human intervention. First, empowered by the Large Language Model (LLM), APT-CGLP mitigates data scarcity by synthesizing high-fidelity provenance graph-CTI report pairs, while simultaneously distilling actionable insights from noisy web-sourced CTIs to improve their operational utility. Second, APT-CGLP incorporates a tailored multi-objective training algorithm that synergizes contrastive learning with inter-modal masked modeling, promoting cross-modal attack semantic alignment at both coarse- and fine-grained levels. Extensive experiments on four real-world APT datasets demonstrate that APT-CGLP consistently outperforms state-of-the-art threat hunting baselines in terms of accuracy and efficiency.", "published": "2025-11-25T13:20:12Z", "updated": "2025-12-31T01:51:00Z", "authors": ["Xuebo Qiu", "Mingqi Lv", "Yimei Zhang", "Tieming Chen", "Tiantian Zhu", "Qijie Song", "Shouling Ji"], "pdf_url": "https://arxiv.org/pdf/2511.20290v2"}
{"id": "http://arxiv.org/abs/2503.08990v2", "title": "Effective and Efficient Jailbreaks of Black-Box LLMs with Cross-Behavior Attacks", "summary": "Despite recent advancements in Large Language Models (LLMs) and their alignment, they can still be jailbroken, i.e., harmful and toxic content can be elicited from them. While existing red-teaming methods have shown promise in uncovering such vulnerabilities, these methods struggle with limited success and high computational and monetary costs. To address this, we propose a black-box Jailbreak method with Cross-Behavior attacks (JCB), that can automatically and efficiently find successful jailbreak prompts. JCB leverages successes from past behaviors to help jailbreak new behaviors, thereby significantly improving the attack efficiency. Moreover, JCB does not rely on time- and/or cost-intensive calls to auxiliary LLMs to discover/optimize the jailbreak prompts, making it highly efficient and scalable. Comprehensive experimental evaluations show that JCB significantly outperforms related baselines, requiring up to 94% fewer queries while still achieving 12.9% higher average attack success. JCB also achieves a notably high 37% attack success rate on Llama-2-7B, one of the most resilient LLMs, and shows promising zero-shot transferability across different LLMs.", "published": "2025-03-12T01:52:17Z", "updated": "2025-12-31T01:02:36Z", "authors": ["Vasudev Gohil"], "pdf_url": "https://arxiv.org/pdf/2503.08990v2"}
{"id": "http://arxiv.org/abs/2307.15657v2", "title": "Almost perfect nonlinear power functions with exponents expressed as fractions", "summary": "Let $F$ be a finite field, let $f$ be a function from $F$ to $F$, and let $a$ be a nonzero element of $F$. The discrete derivative of $f$ in direction $a$ is $Δ_a f \\colon F \\to F$ with $(Δ_a f)(x)=f(x+a)-f(x)$. The differential spectrum of $f$ is the multiset of cardinalities of all the fibers of all the derivatives $Δ_a f$ as $a$ runs through $F^*$. An almost perfect nonlinear (APN) function is one for which the largest cardinality in its differential spectrum is $2$. Almost perfect nonlinear functions are of interest as cryptographic primitives. If $d$ is a positive integer, then the power function over $F$ with exponent $d$ is the function $f \\colon F \\to F$ with $f(x)=x^d$ for every $x \\in F$. There is a small number of known infinite families of APN power functions. In this paper, we re-express the exponents for one such family in a more convenient form. This enables us not only to obtain the differential spectrum of each power function $f$ with an exponent in our family, but also to determine the elements that lie in an arbitrary fiber of the discrete derivative of $f$. This differential analysis, which is far more detailed than previous results, is achieved by composing the discrete derivative of $f$ with some permutations and a double covering of its domain to obtain a function whose fibers can more readily be analyzed.", "published": "2023-07-28T16:38:38Z", "updated": "2025-12-31T00:56:25Z", "authors": ["Daniel J. Katz", "Kathleen R. O'Connor", "Kyle Pacheco", "Yakov Sapozhnikov"], "pdf_url": "https://arxiv.org/pdf/2307.15657v2"}
{"id": "http://arxiv.org/abs/2512.24531v1", "title": "Correctness of Extended RSA Public Key Cryptosystem", "summary": "This paper proposes an alternative approach to formally establishing the correctness of the RSA public key cryptosystem. The methodology presented herein deviates slightly from conventional proofs found in existing literature. Specifically, this study explores the conditions under which the choice of the positive integer N, a fundamental component of RSA, can be extended beyond the standard selection criteria. We derive explicit conditions that determine when certain values of N are valid for the encryption scheme and explain why others may fail to satisfy the correctness requirements. The scope of this paper is limited to the mathematical proof of correctness for RSA-like schemes, deliberately omitting issues related to the cryptographic security of RSA.", "published": "2025-12-31T00:26:23Z", "updated": "2025-12-31T00:26:23Z", "authors": ["Dar-jen Chang", "Suranjan Gautam"], "pdf_url": "https://arxiv.org/pdf/2512.24531v1"}
