{"id": "http://arxiv.org/abs/2512.16904v1", "title": "How Good is Post-Hoc Watermarking With Language Model Rephrasing?", "summary": "Generation-time text watermarking embeds statistical signals into text for traceability of AI-generated content. We explore *post-hoc watermarking* where an LLM rewrites existing text while applying generation-time watermarking, to protect copyrighted documents, or detect their use in training or RAG via watermark radioactivity. Unlike generation-time approaches, which is constrained by how LLMs are served, this setting offers additional degrees of freedom for both generation and detection. We investigate how allocating compute (through larger rephrasing models, beam search, multi-candidate generation, or entropy filtering at detection) affects the quality-detectability trade-off. Our strategies achieve strong detectability and semantic fidelity on open-ended text such as books. Among our findings, the simple Gumbel-max scheme surprisingly outperforms more recent alternatives under nucleus sampling, and most methods benefit significantly from beam search. However, most approaches struggle when watermarking verifiable text such as code, where we counterintuitively find that smaller models outperform larger ones. This study reveals both the potential and limitations of post-hoc watermarking, laying groundwork for practical applications and future research.", "published": "2025-12-18T18:57:33Z", "updated": "2025-12-18T18:57:33Z", "authors": ["Pierre Fernandez", "Tom Sander", "Hady Elsahar", "Hongyan Chang", "Tomáš Souček", "Valeriu Lacatusu", "Tuan Tran", "Sylvestre-Alvise Rebuffi", "Alexandre Mourachko"], "pdf_url": "https://arxiv.org/pdf/2512.16904v1"}
{"id": "http://arxiv.org/abs/2512.16874v1", "title": "Pixel Seal: Adversarial-only training for invisible image and video watermarking", "summary": "Invisible watermarking is essential for tracing the provenance of digital content. However, training state-of-the-art models remains notoriously difficult, with current approaches often struggling to balance robustness against true imperceptibility. This work introduces Pixel Seal, which sets a new state-of-the-art for image and video watermarking. We first identify three fundamental issues of existing methods: (i) the reliance on proxy perceptual losses such as MSE and LPIPS that fail to mimic human perception and result in visible watermark artifacts; (ii) the optimization instability caused by conflicting objectives, which necessitates exhaustive hyperparameter tuning; and (iii) reduced robustness and imperceptibility of watermarks when scaling models to high-resolution images and videos. To overcome these issues, we first propose an adversarial-only training paradigm that eliminates unreliable pixel-wise imperceptibility losses. Second, we introduce a three-stage training schedule that stabilizes convergence by decoupling robustness and imperceptibility. Third, we address the resolution gap via high-resolution adaptation, employing JND-based attenuation and training-time inference simulation to eliminate upscaling artifacts. We thoroughly evaluate the robustness and imperceptibility of Pixel Seal on different image types and across a wide range of transformations, and show clear improvements over the state-of-the-art. We finally demonstrate that the model efficiently adapts to video via temporal watermark pooling, positioning Pixel Seal as a practical and scalable solution for reliable provenance in real-world image and video settings.", "published": "2025-12-18T18:42:19Z", "updated": "2025-12-18T18:42:19Z", "authors": ["Tomáš Souček", "Pierre Fernandez", "Hady Elsahar", "Sylvestre-Alvise Rebuffi", "Valeriu Lacatusu", "Tuan Tran", "Tom Sander", "Alexandre Mourachko"], "pdf_url": "https://arxiv.org/pdf/2512.16874v1"}
{"id": "http://arxiv.org/abs/2512.16851v1", "title": "PrivateXR: Defending Privacy Attacks in Extended Reality Through Explainable AI-Guided Differential Privacy", "summary": "The convergence of artificial AI and XR technologies (AI XR) promises innovative applications across many domains. However, the sensitive nature of data (e.g., eye-tracking) used in these systems raises significant privacy concerns, as adversaries can exploit these data and models to infer and leak personal information through membership inference attacks (MIA) and re-identification (RDA) with a high success rate. Researchers have proposed various techniques to mitigate such privacy attacks, including differential privacy (DP). However, AI XR datasets often contain numerous features, and applying DP uniformly can introduce unnecessary noise to less relevant features, degrade model accuracy, and increase inference time, limiting real-time XR deployment. Motivated by this, we propose a novel framework combining explainable AI (XAI) and DP-enabled privacy-preserving mechanisms to defend against privacy attacks. Specifically, we leverage post-hoc explanations to identify the most influential features in AI XR models and selectively apply DP to those features during inference. We evaluate our XAI-guided DP approach on three state-of-the-art AI XR models and three datasets: cybersickness, emotion, and activity classification. Our results show that the proposed method reduces MIA and RDA success rates by up to 43% and 39%, respectively, for cybersickness tasks while preserving model utility with up to 97% accuracy using Transformer models. Furthermore, it improves inference time by up to ~2x compared to traditional DP approaches. To demonstrate practicality, we deploy the XAI-guided DP AI XR models on an HTC VIVE Pro headset and develop a user interface (UI), namely PrivateXR, allowing users to adjust privacy levels (e.g., low, medium, high) while receiving real-time task predictions, protecting user privacy during XR gameplay.", "published": "2025-12-18T18:23:06Z", "updated": "2025-12-18T18:23:06Z", "authors": ["Ripan Kumar Kundu", "Istiak Ahmed", "Khaza Anuarul Hoque"], "pdf_url": "https://arxiv.org/pdf/2512.16851v1"}
{"id": "http://arxiv.org/abs/2512.10361v2", "title": "Bit of a Close Talker: A Practical Guide to Serverless Cloud Co-Location Attacks", "summary": "Serverless computing has revolutionized cloud computing by offering users an efficient, cost-effective way to develop and deploy applications without managing infrastructure details. However, serverless cloud users remain vulnerable to various types of attacks, including micro-architectural side-channel attacks. These attacks typically rely on the physical co-location of victim and attacker instances, and attackers need to exploit cloud schedulers to achieve co-location with victims. Therefore, it is crucial to study vulnerabilities in serverless cloud schedulers and assess the security of different serverless scheduling algorithms. This study addresses the gap in understanding and constructing co-location attacks in serverless clouds. We present a comprehensive methodology to uncover exploitable features in serverless scheduling algorithms and to devise strategies for constructing co-location attacks via normal user interfaces. In our experiments, we successfully reveal exploitable vulnerabilities and achieve instance co-location on prevalent open-source infrastructures and Microsoft Azure Functions. We also present a mitigation strategy, the Double-Dip scheduler, to defend against co-location attacks in serverless clouds. Our work highlights critical areas for security enhancements in current cloud schedulers, offering insights to fortify serverless computing environments against potential co-location attacks.", "published": "2025-12-11T07:22:07Z", "updated": "2025-12-18T17:56:32Z", "authors": ["Wei Shao", "Najmeh Nazari", "Behnam Omidi", "Setareh Rafatirad", "Houman Homayoun", "Khaled N. Khasawneh", "Chongzhou Fang"], "pdf_url": "https://arxiv.org/pdf/2512.10361v2"}
{"id": "http://arxiv.org/abs/2411.14516v2", "title": "Memory Backdoor Attacks on Neural Networks", "summary": "Neural networks are often trained on proprietary datasets, making them attractive attack targets. We present a novel dataset extraction method leveraging an innovative training time backdoor attack, allowing a malicious federated learning server to systematically and deterministically extract complete client training samples through a simple indexing process. Unlike prior techniques, our approach guarantees exact data recovery rather than probabilistic reconstructions or hallucinations, provides precise control over which samples are memorized and how many, and shows high capacity and robustness. Infected models output data samples when they receive a patternbased index trigger, enabling systematic extraction of meaningful patches from each clients local data without disrupting global model utility. To address small model output sizes, we extract patches and then recombined them. The attack requires only a minor modification to the training code that can easily evade detection during client-side verification. Hence, this vulnerability represents a realistic FL supply-chain threat, where a malicious server can distribute modified training code to clients and later recover private data from their updates. Evaluations across classifiers, segmentation models, and large language models demonstrate that thousands of sensitive training samples can be recovered from client models with minimal impact on task performance, and a clients entire dataset can be stolen after multiple FL rounds. For instance, a medical segmentation dataset can be extracted with only a 3 percent utility drop. These findings expose a critical privacy vulnerability in FL systems, emphasizing the need for stronger integrity and transparency in distributed training pipelines.", "published": "2024-11-21T16:09:16Z", "updated": "2025-12-18T17:55:07Z", "authors": ["Eden Luzon", "Guy Amit", "Roy Weiss", "Torsten Kraub", "Alexandra Dmitrienko", "Yisroel Mirsky"], "pdf_url": "https://arxiv.org/pdf/2411.14516v2"}
{"id": "http://arxiv.org/abs/2512.16778v1", "title": "Non-Linear Strong Data-Processing for Quantum Hockey-Stick Divergences", "summary": "Data-processing is a desired property of classical and quantum divergences and information measures. In information theory, the contraction coefficient measures how much the distinguishability of quantum states decreases when they are transmitted through a quantum channel, establishing linear strong data-processing inequalities (SDPI). However, these linear SDPI are not always tight and can be improved in most of the cases. In this work, we establish non-linear SDPI for quantum hockey-stick divergence for noisy channels that satisfy a certain noise criterion. We also note that our results improve upon existing linear SDPI for quantum hockey-stick divergences and also non-linear SDPI for classical hockey-stick divergence. We define $F_γ$ curves generalizing Dobrushin curves for the quantum setting while characterizing SDPI for the sequential composition of heterogeneous channels. In addition, we derive reverse-Pinsker type inequalities for $f$-divergences with additional constraints on hockey-stick divergences. We show that these non-linear SDPI can establish tighter finite mixing times that cannot be achieved through linear SDPI. Furthermore, we find applications of these in establishing stronger privacy guarantees for the composition of sequential private quantum channels when privacy is quantified by quantum local differential privacy.", "published": "2025-12-18T17:10:22Z", "updated": "2025-12-18T17:10:22Z", "authors": ["Theshani Nuradha", "Ian George", "Christoph Hirche"], "pdf_url": "https://arxiv.org/pdf/2512.16778v1"}
{"id": "http://arxiv.org/abs/2512.16719v1", "title": "Channel State Information Preprocessing for CSI-based Physical-Layer Authentication Using Reconciliation", "summary": "This paper introduces an adaptive preprocessing technique to enhance the accuracy of channel state information-based physical layer authentication (CSI-PLA) alleviating CSI variations and inconsistencies in the time domain. To this end, we develop an adaptive robust principal component analysis (A-RPCA) preprocessing method based on robust principal component analysis (RPCA). The performance evaluation is then conducted using a PLA framework based on information reconciliation, in which Gaussian approximation (GA) for Polar codes is leveraged for the design of short codelength Slepian Wolf decoders. Furthermore, an analysis of the proposed A-RPCA methods is carried out. Simulation results show that compared to a baseline scheme without preprocessing and without reconciliation, the proposed A-RPCA method substantially reduces the error probability after reconciliation and also substantially increases the detection probabilities that is also 1 in both line-of-sight (LOS) and non-line-of-sight (NLOS) scenarios. We have compared against state-of the-art preprocessing schemes in both synthetic and real datasets, including principal component analysis (PCA) and robust PCA, autoencoders and the recursive projected compressive sensing (ReProCS) framework and we have validated the superior performance of the proposed approach.", "published": "2025-12-18T16:22:03Z", "updated": "2025-12-18T16:22:03Z", "authors": ["Atsu Kokuvi Angelo Passah", "Rodrigo C. de Lamare", "Arsenia Chorti"], "pdf_url": "https://arxiv.org/pdf/2512.16719v1"}
{"id": "http://arxiv.org/abs/2512.16717v1", "title": "Phishing Detection System: An Ensemble Approach Using Character-Level CNN and Feature Engineering", "summary": "In actuality, phishing attacks remain one of the most prevalent cybersecurity risks in existence today, with malevolent actors constantly changing their strategies to successfully trick users. This paper presents an AI model for a phishing detection system that uses an ensemble approach to combine character-level Convolutional Neural Networks (CNN) and LightGBM with engineered features. Our system uses a character-level CNN to extract sequential features after extracting 36 lexical, structural, and domain-based features from the URLs. On a test dataset of 19,873 URLs, the ensemble model achieves an accuracy of 99.819 percent, precision of 100 percent, recall of 99.635 percent, and ROC-AUC of 99.947 percent. Through a FastAPI-based service with an intuitive user interface, the suggested system has been utilised to offer real-time detection. In contrast, the results demonstrate that the suggested solution performs better than individual models; LightGBM contributes 40 percent and character-CNN contributes 60 percent to the final prediction. The suggested method maintains extremely low false positive rates while doing a good job of identifying contemporary phishing techniques. Index Terms - Phishing detection, machine learning, deep learning, CNN, ensemble methods, cybersecurity, URL analysis", "published": "2025-12-18T16:19:12Z", "updated": "2025-12-18T16:19:12Z", "authors": ["Rudra Dubey", "Arpit Mani Tripathi", "Archit Srivastava", "Sarvpal Singh"], "pdf_url": "https://arxiv.org/pdf/2512.16717v1"}
{"id": "http://arxiv.org/abs/2512.16683v1", "title": "Efficient Bitcoin Meta-Protocol Transaction and Data Discovery Through nLockTime Field Repurposing", "summary": "We describe the Lockchain Protocol, a lightweight Bitcoin meta-protocol that enables highly efficient transaction discovery at zero marginal block space cost, and data verification without introducing any new on-chain storage mechanism. The protocol repurposes the mandatory 4-byte nLockTime field of every Bitcoin transaction as a compact metadata header. By constraining values to an unused range of past Unix timestamps greater than or equal to 500,000,000, the field can encode a protocol signal, type, variant, and sequence identifier while remaining fully valid under Bitcoin consensus and policy rules. The primary contribution of the protocol is an efficient discovery layer. Indexers can filter candidate transactions by examining a fixed-size header field, independent of transaction payload size, and only then selectively inspect heavier data such as OP RETURN outputs or witness fields. The Lockchain Protocol applies established protocol design patterns to an under-optimised problem domain, namely transaction discovery at scale, and does not claim new cryptographic primitives or storage methods.", "published": "2025-12-18T15:49:28Z", "updated": "2025-12-18T15:49:28Z", "authors": ["Nikodem Tomczak"], "pdf_url": "https://arxiv.org/pdf/2512.16683v1"}
{"id": "http://arxiv.org/abs/2511.07503v3", "title": "Biologically-Informed Hybrid Membership Inference Attacks on Generative Genomic Models", "summary": "The increased availability of genetic data has transformed genomics research, but raised many privacy concerns regarding its handling due to its sensitive nature. This work explores the use of language models (LMs) for the generation of synthetic genetic mutation profiles, leveraging differential privacy (DP) for the protection of sensitive genetic data. We empirically evaluate the privacy guarantees of our DP modes by introducing a novel Biologically-Informed Hybrid Membership Inference Attack (biHMIA), which combines traditional black box MIA with contextual genomics metrics for enhanced attack power. Our experiments show that both small and large transformer GPT-like models are viable synthetic variant generators for small-scale genomics, and that our hybrid attack leads, on average, to higher adversarial success compared to traditional metric-based MIAs.", "published": "2025-11-10T17:09:19Z", "updated": "2025-12-18T15:39:00Z", "authors": ["Asia Belfiore", "Jonathan Passerat-Palmbach", "Dmitrii Usynin"], "pdf_url": "https://arxiv.org/pdf/2511.07503v3"}
{"id": "http://arxiv.org/abs/2512.16658v1", "title": "Protecting Deep Neural Network Intellectual Property with Chaos-Based White-Box Watermarking", "summary": "The rapid proliferation of deep neural networks (DNNs) across several domains has led to increasing concerns regarding intellectual property (IP) protection and model misuse. Trained DNNs represent valuable assets, often developed through significant investments. However, the ease with which models can be copied, redistributed, or repurposed highlights the urgent need for effective mechanisms to assert and verify model ownership. In this work, we propose an efficient and resilient white-box watermarking framework that embeds ownership information into the internal parameters of a DNN using chaotic sequences. The watermark is generated using a logistic map, a well-known chaotic function, producing a sequence that is sensitive to its initialization parameters. This sequence is injected into the weights of a chosen intermediate layer without requiring structural modifications to the model or degradation in predictive performance. To validate ownership, we introduce a verification process based on a genetic algorithm that recovers the original chaotic parameters by optimizing the similarity between the extracted and regenerated sequences. The effectiveness of the proposed approach is demonstrated through extensive experiments on image classification tasks using MNIST and CIFAR-10 datasets. The results show that the embedded watermark remains detectable after fine-tuning, with negligible loss in model accuracy. In addition to numerical recovery of the watermark, we perform visual analyses using weight density plots and construct activation-based classifiers to distinguish between original, watermarked, and tampered models. Overall, the proposed method offers a flexible and scalable solution for embedding and verifying model ownership in white-box settings well-suited for real-world scenarios where IP protection is critical.", "published": "2025-12-18T15:26:50Z", "updated": "2025-12-18T15:26:50Z", "authors": ["Sangeeth B", "Serena Nicolazzo", "Deepa K.", "Vinod P"], "pdf_url": "https://arxiv.org/pdf/2512.16658v1"}
{"id": "http://arxiv.org/abs/2512.16650v1", "title": "Prefix Probing: Lightweight Harmful Content Detection for Large Language Models", "summary": "Large language models often face a three-way trade-off among detection accuracy, inference latency, and deployment cost when used in real-world safety-sensitive applications. This paper introduces Prefix Probing, a black-box harmful content detection method that compares the conditional log-probabilities of \"agreement/execution\" versus \"refusal/safety\" opening prefixes and leverages prefix caching to reduce detection overhead to near first-token latency. During inference, the method requires only a single log-probability computation over the probe prefixes to produce a harmfulness score and apply a threshold, without invoking any additional models or multi-stage inference. To further enhance the discriminative power of the prefixes, we design an efficient prefix construction algorithm that automatically discovers highly informative prefixes, substantially improving detection performance. Extensive experiments demonstrate that Prefix Probing achieves detection effectiveness comparable to mainstream external safety models while incurring only minimal computational cost and requiring no extra model deployment, highlighting its strong practicality and efficiency.", "published": "2025-12-18T15:22:14Z", "updated": "2025-12-18T15:22:14Z", "authors": ["Jirui Yang", "Hengqi Guo", "Zhihui Lu", "Yi Zhao", "Yuansen Zhang", "Shijing Hu", "Qiang Duan", "Yinggui Wang", "Tao Wei"], "pdf_url": "https://arxiv.org/pdf/2512.16650v1"}
{"id": "http://arxiv.org/abs/2511.04399v2", "title": "Tight Analysis of a One-Shot Quantum Secret Sharing Scheme", "summary": "Quantum communication protocols can be designed to detect eavesdropping attacks, something that classical technologies are unable to do since classical information can be replicated in a non-destructive manner. Eavesdropping detection is, therefore, a standard feature in all the proposed quantum secret sharing (QSS) protocols. However, detection is often done by a statistical analysis of the outcome of multiple decoy rounds, and this causes a significant communication overhead.\n  In our quest for a QSS protocol that works even in one round, we came across a one-shot secret-sharing framework proposed by Hsu (Phys. Rev. A 2003). The scheme was designed to work over public channels without requiring multiple rounds to detect eavesdropping but it lacked a thorough security analysis. In this work we present a complete characterisation of the correctness and security properties of this framework. Our characterisation allowed us to improve the original protocol to be more resistant towards eavesdropping. However, we prove a couple of impossibility results, including one that dictates that complete security against an eavesdropper is not possible in this framework. Thus, it is not possible to design a perfect QSS using this framework.", "published": "2025-11-06T14:26:40Z", "updated": "2025-12-18T14:18:43Z", "authors": ["Santanu Majhi", "Debajyoti Bera"], "pdf_url": "https://arxiv.org/pdf/2511.04399v2"}
{"id": "http://arxiv.org/abs/2512.16538v1", "title": "A Systematic Study of Code Obfuscation Against LLM-based Vulnerability Detection", "summary": "As large language models (LLMs) are increasingly adopted for code vulnerability detection, their reliability and robustness across diverse vulnerability types have become a pressing concern. In traditional adversarial settings, code obfuscation has long been used as a general strategy to bypass auditing tools, preserving exploitability without tampering with the tools themselves. Numerous efforts have explored obfuscation methods and tools, yet their capabilities differ in terms of supported techniques, granularity, and programming languages, making it difficult to systematically assess their impact on LLM-based vulnerability detection. To address this gap, we provide a structured systematization of obfuscation techniques and evaluate them under a unified framework. Specifically, we categorize existing obfuscation methods into three major classes (layout, data flow, and control flow) covering 11 subcategories and 19 concrete techniques. We implement these techniques across four programming languages (Solidity, C, C++, and Python) using a consistent LLM-driven approach, and evaluate their effects on 15 LLMs spanning four model families (DeepSeek, OpenAI, Qwen, and LLaMA), as well as on two coding agents (GitHub Copilot and Codex). Our findings reveal both positive and negative impacts of code obfuscation on LLM-based vulnerability detection, highlighting conditions under which obfuscation leads to performance improvements or degradations. We further analyze these outcomes with respect to vulnerability characteristics, code properties, and model attributes. Finally, we outline several open problems and propose future directions to enhance the robustness of LLMs for real-world vulnerability detection.", "published": "2025-12-18T13:49:59Z", "updated": "2025-12-18T13:49:59Z", "authors": ["Xiao Li", "Yue Li", "Hao Wu", "Yue Zhang", "Yechao Zhang", "Fengyuan Xu", "Sheng Zhong"], "pdf_url": "https://arxiv.org/pdf/2512.16538v1"}
{"id": "http://arxiv.org/abs/2503.02648v2", "title": "Practical Unclonable Encryption with Continuous Variables", "summary": "We propose the first continuous-variable (CV) unclonable encryption scheme, extending the paradigm of quantum encryption of classical messages (QECM) to CV systems. In our construction, a classical message is first encrypted classically and then encoded using an errorcorrecting code. Each bit of the codeword is mapped to a CV mode by creating a coherent state which is squeezed in the q or p quadrature direction, with a small displacement that encodes the bit. The squeezing directions are part of the encryption key. We prove unclonability in the framework introduced by Broadbent and Lord, via a reduction of the cloning game to a CV monogamy-of-entanglement game. Furthermore, we demonstrate that our scheme can be readily implemented with current technology. By incorporating realistic imperfections such as channel noise and detector inefficiencies, we show that the protocol remains robust under these conditions.", "published": "2025-03-04T14:10:15Z", "updated": "2025-12-18T13:08:36Z", "authors": ["Arpan Akash Ray", "Boris Škorić"], "pdf_url": "https://arxiv.org/pdf/2503.02648v2"}
{"id": "http://arxiv.org/abs/2508.17361v2", "title": "Trust Me, I Know This Function: Hijacking LLM Static Analysis using Bias", "summary": "Large Language Models (LLMs) are increasingly trusted to perform automated code review and static analysis at scale, supporting tasks such as vulnerability detection, summarization, and refactoring. In this paper, we identify and exploit a critical vulnerability in LLM-based code analysis: an abstraction bias that causes models to overgeneralize familiar programming patterns and overlook small, meaningful bugs. Adversaries can exploit this blind spot to hijack the control flow of the LLM's interpretation with minimal edits and without affecting actual runtime behavior. We refer to this attack as a Familiar Pattern Attack (FPA).\n  We develop a fully automated, black-box algorithm that discovers and injects FPAs into target code. Our evaluation shows that FPAs are not only effective against basic and reasoning models, but are also transferable across model families (OpenAI, Anthropic, Google), and universal across programming languages (Python, C, Rust, Go). Moreover, FPAs remain effective even when models are explicitly warned about the attack via robust system prompts. Finally, we explore positive, defensive uses of FPAs and discuss their broader implications for the reliability and safety of code-oriented LLMs.", "published": "2025-08-24T13:42:48Z", "updated": "2025-12-18T12:41:54Z", "authors": ["Shir Bernstein", "David Beste", "Daniel Ayzenshteyn", "Lea Schonherr", "Yisroel Mirsky"], "pdf_url": "https://arxiv.org/pdf/2508.17361v2"}
{"id": "http://arxiv.org/abs/2512.16439v1", "title": "From Essence to Defense: Adaptive Semantic-aware Watermarking for Embedding-as-a-Service Copyright Protection", "summary": "Benefiting from the superior capabilities of large language models in natural language understanding and generation, Embeddings-as-a-Service (EaaS) has emerged as a successful commercial paradigm on the web platform. However, prior studies have revealed that EaaS is vulnerable to imitation attacks. Existing methods protect the intellectual property of EaaS through watermarking techniques, but they all ignore the most important properties of embedding: semantics, resulting in limited harmlessness and stealthiness. To this end, we propose SemMark, a novel semantic-based watermarking paradigm for EaaS copyright protection. SemMark employs locality-sensitive hashing to partition the semantic space and inject semantic-aware watermarks into specific regions, ensuring that the watermark signals remain imperceptible and diverse. In addition, we introduce the adaptive watermark weight mechanism based on the local outlier factor to preserve the original embedding distribution. Furthermore, we propose Detect-Sampling and Dimensionality-Reduction attacks and construct four scenarios to evaluate the watermarking method. Extensive experiments are conducted on four popular NLP datasets, and SemMark achieves superior verifiability, diversity, stealthiness, and harmlessness.", "published": "2025-12-18T11:50:38Z", "updated": "2025-12-18T11:50:38Z", "authors": ["Hao Li", "Yubing Ren", "Yanan Cao", "Yingjie Li", "Fang Fang", "Xuebin Wang"], "pdf_url": "https://arxiv.org/pdf/2512.16439v1"}
{"id": "http://arxiv.org/abs/2512.16419v1", "title": "Large Language Models as a (Bad) Security Norm in the Context of Regulation and Compliance", "summary": "The use of Large Language Models (LLM) by providers of cybersecurity and digital infrastructures of all kinds is an ongoing development. It is suggested and on an experimental basis used to write the code for the systems, and potentially fed with sensitive data or what would otherwise be considered trade secrets. Outside of these obvious points, this paper asks how AI can negatively affect cybersecurity and law when used for the design and deployment of security infrastructure by its developers.\n  Firstly, the paper discusses the use of LLMs in security, either directly or indirectly, and briefly tackles other types of AI. It then lists norms in cybersecurity, then a range of legal cybersecurity obligations from the European Union, to create a frame of reference. Secondly, the paper describes how LLMs may fail to fulfil both legal obligations and best practice in cybersecurity is given, and the paper ends with some economic and practical consequences for this development, with some notions of solutions as well.\n  The paper finds that using LLMs comes with many risks, many of which are against good security practice, and the legal obligations in security regulation. This is because of the inherent weaknesses of LLMs, most of which are mitigated if replaced with symbolic AI. Both also have issues fulfilling basic traceability obligations and practice. Solutions are secondary systems surrounding LLM based AI, fulfilment of security norms beyond legal requirements and simply not using such technology in certain situations.", "published": "2025-12-18T11:14:21Z", "updated": "2025-12-18T11:14:21Z", "authors": ["Kaspar Rosager Ludvigsen"], "pdf_url": "https://arxiv.org/pdf/2512.16419v1"}
{"id": "http://arxiv.org/abs/2512.16394v1", "title": "SoK: Reviewing Two Decades of Security, Privacy, Accessibility, and Usability Studies on Internet of Things for Older Adults", "summary": "The Internet of Things (IoT) has the potential to enhance older adults' independence and quality of life, but it also exposes them to security, privacy, accessibility, and usability (SPAU) risks. We conducted a systematic review of 44 peer-reviewed studies published between 2004 and 2024 using a five-phase screening pipeline. From each study, we extracted data on study design, IoT type, SPAU measures, and identified research gaps. We introduce the SPAU-IoT Framework, which comprises 27 criteria across four dimensions: security (e.g., resilience to cyber threats, secure authentication, encrypted communication, secure-by-default settings, and guardianship features), privacy (e.g., data minimization, explicit consent, and privacy-preserving analytics), accessibility (e.g., compliance with ADA/WCAG standards and assistive-technology compatibility), and usability (e.g., guided interaction, integrated assistance, and progressive learning). Applying this framework revealed that more than 70% of studies implemented authentication and encryption mechanisms, whereas fewer than 50% addressed accessibility or usability concerns. We further developed a threat model that maps IoT assets, networks, and backend servers to exploit vectors such as phishing, caregiver exploitation, and weak-password attacks, explicitly accounting for age-related vulnerabilities including cognitive decline and sensory impairment. Our results expose a systemic lack of integrated SPAU approaches in existing IoT research and translate these gaps into actionable, standards-aligned design guidelines for IoT systems designed for older adults.", "published": "2025-12-18T10:43:41Z", "updated": "2025-12-18T10:43:41Z", "authors": ["Suleiman Saka", "Sanchari Das"], "pdf_url": "https://arxiv.org/pdf/2512.16394v1"}
{"id": "http://arxiv.org/abs/2511.13654v2", "title": "Tuning for Two Adversaries: Enhancing the Robustness Against Transfer and Query-Based Attacks using Hyperparameter Tuning", "summary": "In this paper, we present the first detailed analysis of how training hyperparameters -- such as learning rate, weight decay, momentum, and batch size -- influence robustness against both transfer-based and query-based attacks. Supported by theory and experiments, our study spans a variety of practical deployment settings, including centralized training, ensemble learning, and distributed training. We uncover a striking dichotomy: for transfer-based attacks, decreasing the learning rate significantly enhances robustness by up to $64\\%$. In contrast, for query-based attacks, increasing the learning rate consistently leads to improved robustness by up to $28\\%$ across various settings and data distributions. Leveraging these findings, we explore -- for the first time -- the training hyperparameter space to jointly enhance robustness against both transfer-based and query-based attacks. Our results reveal that distributed models benefit the most from hyperparameter tuning, achieving a remarkable tradeoff by simultaneously mitigating both attack types more effectively than other training setups.", "published": "2025-11-17T18:03:49Z", "updated": "2025-12-18T10:38:34Z", "authors": ["Pascal Zimmer", "Ghassan Karame"], "pdf_url": "https://arxiv.org/pdf/2511.13654v2"}
{"id": "http://arxiv.org/abs/2512.16369v1", "title": "A first look at common RPKI publication practices", "summary": "The RPKI is crucial for securing the routing system of the Internet. With the RPKI, owners of Internet resources can make cryptographically backed claims, for example about the legitimate origin of their IP space. Thousands of networks use this information to detect malicious or accidental route hijacks. The RPKI consists out of 100 distributed repositories. However, public reports claim that some of these repositories are unreliable. A current Internet-Draft suggests best practices on how to operate these repositories, with the goal to improve deployment quality.\n  Inspired by this draft, we take a first look at the operational practices of repositories of the RPKI. We mainly focus on the distribution of RPKI information. We find that there is a wide variety in deployment practices, of which some might risk the availability of parts of the information in the RPKI. This study creates a baseline for measuring the maturity of RPKI repositories in the future.", "published": "2025-12-18T10:09:36Z", "updated": "2025-12-18T10:09:36Z", "authors": ["Moritz Müller-Brus", "Lisa Bruder", "Caspar Schutijser", "Ralph Koning"], "pdf_url": "https://arxiv.org/pdf/2512.16369v1"}
{"id": "http://arxiv.org/abs/2512.16310v1", "title": "Agent Tools Orchestration Leaks More: Dataset, Benchmark, and Mitigation", "summary": "Driven by Large Language Models, the single-agent, multi-tool architecture has become a popular paradigm for autonomous agents due to its simplicity and effectiveness. However, this architecture also introduces a new and severe privacy risk, which we term Tools Orchestration Privacy Risk (TOP-R), where an agent, to achieve a benign user goal, autonomously aggregates information fragments across multiple tools and leverages its reasoning capabilities to synthesize unexpected sensitive information. We provide the first systematic study of this risk. First, we establish a formal framework, attributing the risk's root cause to the agent's misaligned objective function: an overoptimization for helpfulness while neglecting privacy awareness. Second, we construct TOP-Bench, comprising paired leakage and benign scenarios, to comprehensively evaluate this risk. To quantify the trade-off between safety and robustness, we introduce the H-Score as a holistic metric. The evaluation results reveal that TOP-R is a severe risk: the average Risk Leakage Rate (RLR) of eight representative models reaches 90.24%, while the average H-Score is merely 0.167, with no model exceeding 0.3. Finally, we propose the Privacy Enhancement Principle (PEP) method, which effectively mitigates TOP-R, reducing the Risk Leakage Rate to 46.58% and significantly improving the H-Score to 0.624. Our work reveals both a new class of risk and inherent structural limitations in current agent architectures, while also offering feasible mitigation strategies.", "published": "2025-12-18T08:50:57Z", "updated": "2025-12-18T08:50:57Z", "authors": ["Yuxuan Qiao", "Dongqin Liu", "Hongchang Yang", "Wei Zhou", "Songlin Hu"], "pdf_url": "https://arxiv.org/pdf/2512.16310v1"}
{"id": "http://arxiv.org/abs/2512.16307v1", "title": "Beyond the Benchmark: Innovative Defenses Against Prompt Injection Attacks", "summary": "In this fast-evolving area of LLMs, our paper discusses the significant security risk presented by prompt injection attacks. It focuses on small open-sourced models, specifically the LLaMA family of models. We introduce novel defense mechanisms capable of generating automatic defenses and systematically evaluate said generated defenses against a comprehensive set of benchmarked attacks. Thus, we empirically demonstrated the improvement proposed by our approach in mitigating goal-hijacking vulnerabilities in LLMs. Our work recognizes the increasing relevance of small open-sourced LLMs and their potential for broad deployments on edge devices, aligning with future trends in LLM applications. We contribute to the greater ecosystem of open-source LLMs and their security in the following: (1) assessing present prompt-based defenses against the latest attacks, (2) introducing a new framework using a seed defense (Chain Of Thoughts) to refine the defense prompts iteratively, and (3) showing significant improvements in detecting goal hijacking attacks. Out strategies significantly reduce the success rates of the attacks and false detection rates while at the same time effectively detecting goal-hijacking capabilities, paving the way for more secure and efficient deployments of small and open-source LLMs in resource-constrained environments.", "published": "2025-12-18T08:47:07Z", "updated": "2025-12-18T08:47:07Z", "authors": ["Safwan Shaheer", "G. M. Refatul Islam", "Mohammad Rafid Hamid", "Tahsin Zaman Jilan"], "pdf_url": "https://arxiv.org/pdf/2512.16307v1"}
{"id": "http://arxiv.org/abs/2512.16292v1", "title": "In-Context Probing for Membership Inference in Fine-Tuned Language Models", "summary": "Membership inference attacks (MIAs) pose a critical privacy threat to fine-tuned large language models (LLMs), especially when models are adapted to domain-specific tasks using sensitive data. While prior black-box MIA techniques rely on confidence scores or token likelihoods, these signals are often entangled with a sample's intrinsic properties - such as content difficulty or rarity - leading to poor generalization and low signal-to-noise ratios. In this paper, we propose ICP-MIA, a novel MIA framework grounded in the theory of training dynamics, particularly the phenomenon of diminishing returns during optimization. We introduce the Optimization Gap as a fundamental signal of membership: at convergence, member samples exhibit minimal remaining loss-reduction potential, while non-members retain significant potential for further optimization. To estimate this gap in a black-box setting, we propose In-Context Probing (ICP), a training-free method that simulates fine-tuning-like behavior via strategically constructed input contexts. We propose two probing strategies: reference-data-based (using semantically similar public samples) and self-perturbation (via masking or generation). Experiments on three tasks and multiple LLMs show that ICP-MIA significantly outperforms prior black-box MIAs, particularly at low false positive rates. We further analyze how reference data alignment, model type, PEFT configurations, and training schedules affect attack effectiveness. Our findings establish ICP-MIA as a practical and theoretically grounded framework for auditing privacy risks in deployed LLMs.", "published": "2025-12-18T08:26:26Z", "updated": "2025-12-18T08:26:26Z", "authors": ["Zhexi Lu", "Hongliang Chi", "Nathalie Baracaldo", "Swanand Ravindra Kadhe", "Yuseok Jeon", "Lei Yu"], "pdf_url": "https://arxiv.org/pdf/2512.16292v1"}
{"id": "http://arxiv.org/abs/2512.16284v1", "title": "Empirical Evaluation of Structured Synthetic Data Privacy Metrics: Novel experimental framework", "summary": "Synthetic data generation is gaining traction as a privacy enhancing technology (PET). When properly generated, synthetic data preserve the analytic utility of real data while avoiding the retention of information that would allow the identification of specific individuals. However, the concept of data privacy remains elusive, making it challenging for practitioners to evaluate and benchmark the degree of privacy protection offered by synthetic data. In this paper, we propose a framework to empirically assess the efficacy of tabular synthetic data privacy quantification methods through controlled, deliberate risk insertion. To demonstrate this framework, we survey existing approaches to synthetic data privacy quantification and the related legal theory. We then apply the framework to the main privacy quantification methods with no-box threat models on publicly available datasets.", "published": "2025-12-18T08:09:28Z", "updated": "2025-12-18T08:09:28Z", "authors": ["Milton Nicolás Plasencia Palacios", "Alexander Boudewijn", "Sebastiano Saccani", "Andrea Filippo Ferraris", "Diana Sofronieva", "Giuseppe D'Acquisto", "Filiberto Brozzetti", "Daniele Panfilo", "Luca Bortolussi"], "pdf_url": "https://arxiv.org/pdf/2512.16284v1"}
{"id": "http://arxiv.org/abs/2512.16280v1", "title": "Love, Lies, and Language Models: Investigating AI's Role in Romance-Baiting Scams", "summary": "Romance-baiting scams have become a major source of financial and emotional harm worldwide. These operations are run by organized crime syndicates that traffic thousands of people into forced labor, requiring them to build emotional intimacy with victims over weeks of text conversations before pressuring them into fraudulent cryptocurrency investments. Because the scams are inherently text-based, they raise urgent questions about the role of Large Language Models (LLMs) in both current and future automation.\n  We investigate this intersection by interviewing 145 insiders and 5 scam victims, performing a blinded long-term conversation study comparing LLM scam agents to human operators, and executing an evaluation of commercial safety filters. Our findings show that LLMs are already widely deployed within scam organizations, with 87% of scam labor consisting of systematized conversational tasks readily susceptible to automation. In a week-long study, an LLM agent not only elicited greater trust from study participants (p=0.007) but also achieved higher compliance with requests than human operators (46% vs. 18% for humans). Meanwhile, popular safety filters detected 0.0% of romance baiting dialogues. Together, these results suggest that romance-baiting scams may be amenable to full-scale LLM automation, while existing defenses remain inadequate to prevent their expansion.", "published": "2025-12-18T07:59:15Z", "updated": "2025-12-18T07:59:15Z", "authors": ["Gilad Gressel", "Rahul Pankajakshan", "Shir Rozenfeld", "Ling Li", "Ivan Franceschini", "Krishnahsree Achuthan", "Yisroel Mirsky"], "pdf_url": "https://arxiv.org/pdf/2512.16280v1"}
{"id": "http://arxiv.org/abs/2407.20836v5", "title": "Vulnerabilities in AI-generated Image Detection: The Challenge of Adversarial Attacks", "summary": "Recent advancements in image synthesis, particularly with the advent of GAN and Diffusion models, have amplified public concerns regarding the dissemination of disinformation. To address such concerns, numerous AI-generated Image (AIGI) Detectors have been proposed and achieved promising performance in identifying fake images. However, there still lacks a systematic understanding of the adversarial robustness of AIGI detectors. In this paper, we examine the vulnerability of state-of-the-art AIGI detectors against adversarial attack under white-box and black-box settings, which has been rarely investigated so far. To this end, we propose a new method to attack AIGI detectors. First, inspired by the obvious difference between real images and fake images in the frequency domain, we add perturbations under the frequency domain to push the image away from its original frequency distribution. Second, we explore the full posterior distribution of the surrogate model to further narrow this gap between heterogeneous AIGI detectors, e.g., transferring adversarial examples across CNNs and ViTs. This is achieved by introducing a novel post-train Bayesian strategy that turns a single surrogate into a Bayesian one, capable of simulating diverse victim models using one pre-trained surrogate, without the need for re-training. We name our method as Frequency-based Post-train Bayesian Attack, or FPBA. Through FPBA, we demonstrate that adversarial attacks pose a real threat to AIGI detectors. FPBA can deliver successful black-box attacks across various detectors, generators, defense methods, and even evade cross-generator and compressed image detection, which are crucial real-world detection scenarios. Our code is available at https://github.com/onotoa/fpba.", "published": "2024-07-30T14:07:17Z", "updated": "2025-12-18T07:40:46Z", "authors": ["Yunfeng Diao", "Naixin Zhai", "Changtao Miao", "Zitong Yu", "Xingxing Wei", "Xun Yang", "Meng Wang"], "pdf_url": "https://arxiv.org/pdf/2407.20836v5"}
{"id": "http://arxiv.org/abs/2512.16182v1", "title": "DualGuard: Dual-stream Large Language Model Watermarking Defense against Paraphrase and Spoofing Attack", "summary": "With the rapid development of cloud-based services, large language models (LLMs) have become increasingly accessible through various web platforms. However, this accessibility has also led to growing risks of model abuse. LLM watermarking has emerged as an effective approach to mitigate such misuse and protect intellectual property. Existing watermarking algorithms, however, primarily focus on defending against paraphrase attacks while overlooking piggyback spoofing attacks, which can inject harmful content, compromise watermark reliability, and undermine trust in attribution. To address this limitation, we propose DualGuard, the first watermarking algorithm capable of defending against both paraphrase and spoofing attacks. DualGuard employs the adaptive dual-stream watermarking mechanism, in which two complementary watermark signals are dynamically injected based on the semantic content. This design enables DualGuard not only to detect but also to trace spoofing attacks, thereby ensuring reliable and trustworthy watermark detection. Extensive experiments conducted across multiple datasets and language models demonstrate that DualGuard achieves excellent detectability, robustness, traceability, and text quality, effectively advancing the state of LLM watermarking for real-world applications.", "published": "2025-12-18T05:08:19Z", "updated": "2025-12-18T05:08:19Z", "authors": ["Hao Li", "Yubing Ren", "Yanan Cao", "Yingjie Li", "Fang Fang", "Shi Wang", "Li Guo"], "pdf_url": "https://arxiv.org/pdf/2512.16182v1"}
{"id": "http://arxiv.org/abs/2512.15144v2", "title": "MCPZoo: A Large-Scale Dataset of Runnable Model Context Protocol Servers for AI Agent", "summary": "Model Context Protocol (MCP) enables agents to interact with external tools, yet empirical research on MCP is hindered by the lack of large-scale, accessible datasets. We present MCPZoo, the largest and most comprehensive dataset of MCP servers collected from multiple public sources, comprising 95,142 servers. MCPZoo includes over ten thousand server instances that have been deployed and verified as runnable and interactable, supporting realistic experimentation beyond static analysis. The dataset provides unified metadata and access interfaces, enabling systematic exploration and interaction without manual deployment effort. MCPZoo is released as an open and accessible resource to support research on MCP-based security analysis.", "published": "2025-12-17T07:13:08Z", "updated": "2025-12-18T04:40:26Z", "authors": ["Mengying Wu", "Pei Chen", "Geng Hong", "Baichao An", "Jinsong Chen", "Binwang Wan", "Xudong Pan", "Jiarun Dai", "Min Yang"], "pdf_url": "https://arxiv.org/pdf/2512.15144v2"}
{"id": "http://arxiv.org/abs/2512.16123v1", "title": "Autoencoder-based Denoising Defense against Adversarial Attacks on Object Detection", "summary": "Deep learning-based object detection models play a critical role in real-world applications such as autonomous driving and security surveillance systems, yet they remain vulnerable to adversarial examples. In this work, we propose an autoencoder-based denoising defense to recover object detection performance degraded by adversarial perturbations. We conduct adversarial attacks using Perlin noise on vehicle-related images from the COCO dataset, apply a single-layer convolutional autoencoder to remove the perturbations, and evaluate detection performance using YOLOv5. Our experiments demonstrate that adversarial attacks reduce bbox mAP from 0.2890 to 0.1640, representing a 43.3% performance degradation. After applying the proposed autoencoder defense, bbox mAP improves to 0.1700 (3.7% recovery) and bbox mAP@50 increases from 0.2780 to 0.3080 (10.8% improvement). These results indicate that autoencoder-based denoising can provide partial defense against adversarial attacks without requiring model retraining.", "published": "2025-12-18T03:19:40Z", "updated": "2025-12-18T03:19:40Z", "authors": ["Min Geun Song", "Gang Min Kim", "Woonmin Kim", "Yongsik Kim", "Jeonghyun Sim", "Sangbeom Park", "Huy Kang Kim"], "pdf_url": "https://arxiv.org/pdf/2512.16123v1"}
{"id": "http://arxiv.org/abs/2512.16080v1", "title": "Design of a Decentralized Fixed-Income Lending Automated Market Maker Protocol Supporting Arbitrary Maturities", "summary": "In decentralized finance (DeFi), designing fixed-income lending automated market makers (AMMs) is extremely challenging due to time-related complexities. Moreover, existing protocols only support single-maturity lending. Building upon the BondMM protocol, this paper argues that its mathematical invariants are sufficiently elegant to be generalized to arbitrary maturities. This paper thus propose an improved design, BondMM-A, which supports lending activities of any maturity. By integrating fixed-income instruments of varying maturities into a single smart contract, BondMM-A offers users and liquidity providers (LPs) greater operational freedom and capital efficiency. Experimental results show that BondMM-A performs excellently in terms of interest rate stability and financial robustness.", "published": "2025-12-18T01:56:11Z", "updated": "2025-12-18T01:56:11Z", "authors": ["Tianyi Ma"], "pdf_url": "https://arxiv.org/pdf/2512.16080v1"}
{"id": "http://arxiv.org/abs/2512.16059v1", "title": "ContextLeak: Auditing Leakage in Private In-Context Learning Methods", "summary": "In-Context Learning (ICL) has become a standard technique for adapting Large Language Models (LLMs) to specialized tasks by supplying task-specific exemplars within the prompt. However, when these exemplars contain sensitive information, reliable privacy-preserving mechanisms are essential to prevent unintended leakage through model outputs. Many privacy-preserving methods are proposed to protect the information leakage in the context, but there are less efforts on how to audit those methods. We introduce ContextLeak, the first framework to empirically measure the worst-case information leakage in ICL. ContextLeak uses canary insertion, embedding uniquely identifiable tokens in exemplars and crafting targeted queries to detect their presence. We apply ContextLeak across a range of private ICL techniques, both heuristic such as prompt-based defenses and those with theoretical guarantees such as Embedding Space Aggregation and Report Noisy Max. We find that ContextLeak tightly correlates with the theoretical privacy budget ($ε$) and reliably detects leakage. Our results further reveal that existing methods often strike poor privacy-utility trade-offs, either leaking sensitive information or severely degrading performance.", "published": "2025-12-18T00:53:19Z", "updated": "2025-12-18T00:53:19Z", "authors": ["Jacob Choi", "Shuying Cao", "Xingjian Dong", "Wang Bill Zhu", "Robin Jia", "Sai Praneeth Karimireddy"], "pdf_url": "https://arxiv.org/pdf/2512.16059v1"}
