{"id": "http://arxiv.org/abs/2602.00979v1", "title": "GradingAttack: Attacking Large Language Models Towards Short Answer Grading Ability", "summary": "Large language models (LLMs) have demonstrated remarkable potential for automatic short answer grading (ASAG), significantly boosting student assessment efficiency and scalability in educational scenarios. However, their vulnerability to adversarial manipulation raises critical concerns about automatic grading fairness and reliability. In this paper, we introduce GradingAttack, a fine-grained adversarial attack framework that systematically evaluates the vulnerability of LLM based ASAG models. Specifically, we align general-purpose attack methods with the specific objectives of ASAG by designing token-level and prompt-level strategies that manipulate grading outcomes while maintaining high camouflage. Furthermore, to quantify attack camouflage, we propose a novel evaluation metric that balances attack success and camouflage. Experiments on multiple datasets demonstrate that both attack strategies effectively mislead grading models, with prompt-level attacks achieving higher success rates and token-level attacks exhibiting superior camouflage capability. Our findings underscore the need for robust defenses to ensure fairness and reliability in ASAG. Our code and datasets are available at https://anonymous.4open.science/r/GradingAttack.", "published": "2026-02-01T02:39:51Z", "updated": "2026-02-01T02:39:51Z", "authors": ["Xueyi Li", "Zhuoneng Zhou", "Zitao Liu", "Yongdong Wu", "Weiqi Luo"], "pdf_url": "https://arxiv.org/pdf/2602.00979v1"}
{"id": "http://arxiv.org/abs/2512.01437v2", "title": "Inside Qubic's Selfish Mining Campaign on Monero: Evidence, Tactics, and Limits", "summary": "We analyze Qubic's publicly claimed selfish mining attack against Monero in 2025. By combining measurements from Monero nodes, the Qubic pool API, and Qubic-network observations, we reconstruct Qubic-attributed blocks and effective hashrate and identify ten intervals consistent with block withholding and strategic release. During these intervals, Qubic's average hashrate share rises to 23--34\\%, yet we never observe sustained majority control. We evaluate the attack using the classical selfish mining model and a Markov-chain variant that captures Qubic's conservative release policy. At the inferred parameters, both models predict revenues below honest mining, and our measurements largely confirm this while showing systematic deviations. We attribute the gap to hashrate variability, coarse-grained interval detection, and operational frictions under community countermeasures. We further argue that selfish mining should be analyzed under time-varying hashrate. Even when the average hashrate stays below the static break-even point, an attacker can still run a profitable selfish-mining operation by operating it intermittently.", "published": "2025-12-01T09:22:25Z", "updated": "2026-02-01T02:38:18Z", "authors": ["Suhyeon Lee", "Hyeongyeong Kim"], "pdf_url": "https://arxiv.org/pdf/2512.01437v2"}
